[
  {
    "id": 1,
    "name": "CoolBeans",
    "img": "/public/assets/projects/coffee.png",
    "tech": "Next JS / Tailwind / FireBase",
    "description": "I've always wanted to open my own coffee shop, maybe one day that will happen but for now I created a website for my imaginary café. The foundation of this project of this project was Next JS because of it's great features like a build in router and lazy image loading. All of the styling is done using Tailwind css as it makes it easy and quick to create a beautiful design. I wanted to get some practice in with Firebase so the site has some basic integration. All of the items on the menu are read from the Firebase database and then displayed on the page.",
    "live": "https://coffeeshop-nextjs-rho.vercel.app",
    "code": "https://github.com/MichaelParascandolo/coffeeshop-nextjs",
    "icons": ["Next JS", "Tailwind", "TypeScript", "Firebase"]
  },
  {
    "id": 2,
    "name": "surfcitypizza.com",
    "tech": "React JS / React Router / Bootstrap",
    "img": "public/assets/projects/surfcitypizza.jpg",
    "description": "This site was created for the #1 pizzeria in South Jersey, Surf City Pizza. Users are able to see the restaurant's entire menu as well as their basic info such as phone number, address, etc. The site is fully mobile responsive and is built using React JS. React Router Dom is used to route users to different pages such as the menu, about, and home. This was my first project to utilize Bootstrap for a clean and cohesive design.",
    "live": "https://surfcitypizza.com",
    "code": "https://github.com/MichaelParascandolo/surf-city-pizza",
    "icons": ["React JS", "React Router", "TypeScript", "Bootstrap 5"]
  },
  {
    "id": 3,
    "name": "GameSearch",
    "tech": "React / Tailwind / TypeScript",
    "img": "/public/assets/projects/gamesearch.png",
    "description": "This site was created because I wanted to do a project around something I am passionate about, which is video games! Users are able to search for video games by title name. The title, photo, release date, ESRB rating, metacritic score, and platform(s) of the game are displayed on cards organized in a grid. Users are shown the total number of results and are able to go back and forth through various pages to see more. This site was built using React JS, Tailwind, and TypeScript. Data is pulled from the RAWG API.",
    "live": "https://game-search-react.vercel.app",
    "code": "https://github.com/MichaelParascandolo/game-search-react",
    "icons": ["React JS", "Tailwind", "TypeScript", "RAWG API"]
  },
  {
    "id": 4,
    "name": "Weather",
    "tech": "Angular / HTML / CSS",
    "img": "/public/assets/projects/weather.png",
    "description": "This site was my first project built with Angular, and uses the OpenWeather API. Users are able to see weather information such as temperature (celsius or fahrenheit), max/min temperature, humidity, wind speed, as well as a brief description of the current weather conditions. Users are able to search via the name of a city, zip code, or their your current location.",
    "live": "https://weather-angular-six.vercel.app",
    "code": "https://github.com/MichaelParascandolo/weather-angular",
    "icons": ["Angular", "HTML5", "CSS3", "OpenWeather API"]
  },
  {
    "id": 5,
    "name": "Project Manager",
    "tech": "React / Flask / Tailwind / Sqlite",
    "img": "/public/assets/projects/projectmanager.png",
    "description": "This full-stack web application was developed as a group project for Quality Electric Services during my college studies. The application serves as an internal tool for the company’s employees, providing an easy way to schedule jobs and manage customer records. Its features include user creation and management, customizable user permissions, client creation, job scheduling, and customer history viewing. The application was built using React JS and Tailwind for the front-end, Flask for the back-end, and Sqlite for data storage. While the project is not currently hosted, screenshots of the application can be found in the GitHub repository linked below.",
    "code": "https://github.com/MichaelParascandolo/project-manager-react-flask",
    "icons": ["React JS", "Tailwind", "Flask", "Sqlite"]
  },
  {
    "id": 6,
    "name": "Portfolio",
    "tech": "Next JS / Tailwind / TypeScript",
    "img": "/public/assets/projects/portfolio.png",
    "description": "For this site, I wanted to learn and use a new framework, and I chose NextJS. Tailwind was used to help easily create a clean and cohesive design. TypeScript was added to create a more reliable codebase. Framer-motion was used to create all of the nice transitions and hover effects that you see on the site. EmailJS handles the contact form and makes it functional. Out of all my projects, this is by far the one I am most proud of as it fully expresses the love I have for creating amazing experiences on the web.",
    "code": "https://github.com/MichaelParascandolo/portfolio-nextjs",
    "icons": ["Next JS", "Tailwind", "TypeScript", "Framer Motion"]
  }
]
